Config/Catalogs/ПостоянноДействующиеКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПостоянноДействующиеКомиссии</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кворум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйПроцентЗа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьГолосПредседателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Временная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНеактуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвентаризационная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРабочейКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЧленаКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЧленовКомиссии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйИсполнитель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПредседатель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьУполномоченноеЛицо</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/ИндикаторКворумаПрисутствия/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	ИнициализироватьФормуДокумента(Форма);
		
	ОбновитьСвойстваКомиссии(Форма);
	
	ИндикаторКворумаПрисутствияКлиентСервер.ОбновитьИндикатор(Форма);
	
КонецПроцедуры

Процедура ПриЧтенииНаСервере(Форма) Экспорт
	
	Если Не ВыполненаИнициализацияМеханизма(Форма) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСвойстваКомиссии(Форма);
	
	ИндикаторКворумаПрисутствияКлиентСервер.ОбновитьИндикатор(Форма);
	
КонецПроцедуры

Процедура КомиссияПриИзмененииНаСервере(Форма, Элемент = Неопределено) Экспорт
	
	ОбновитьСвойстваКомиссии(Форма, Элемент);
	
	ИндикаторКворумаПрисутствияКлиентСервер.ОбновитьИндикатор(Форма, Элемент);
	
КонецПроцедуры

Процедура ПроверитьДостижениеКворумаПрисутствияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	// СерииДокументов
	Если ИнвентаризацияКлиентСервер.ЭтоСодержательныйДокументСерииДокументовОписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	// Конец СерииДокументов
	
	ДокументСсылка = Источник.Ссылка;
	
	РезультатыПроверки = ОпределитьДостижениеКворумаПрисутствия(ДокументСсылка);
	
	РезультатПроверки = РезультатыПроверки.Получить(ДокументСсылка);
	
	Если РезультатПроверки.КворумДостигнут Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(
		ПолучитьТекстСообщенияДляОдногоДокумента(РезультатПроверки.КомиссияЗаполнена),
		ДокументСсылка,
		"Объект." + РезультатПроверки.ИмяПоляДляВыводаСообщения);
	
КонецПроцедуры

Процедура ПроверитьДостижениеКворумаПрисутствияПриПечати(СписокДокументов) Экспорт
	
	Если СписокДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РезультатыПроверки = ОпределитьДостижениеКворумаПрисутствия(СписокДокументов);
	
	Представление = ПолучитьПредставлениеСпискаДокументовСНедостигнутымКворумом(РезультатыПроверки);
	
	Если Не ЗначениеЗаполнено(Представление) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(Представление);
	
КонецПроцедуры

Функция ОпределитьДостижениеКворумаПрисутствия(СписокДокументов) Экспорт
	
	Если ТипЗнч(СписокДокументов) = Тип("Массив") Или ТипЗнч(СписокДокументов) = Тип("СписокЗначений") Тогда
		Список = СписокДокументов;
	Иначе
		Список = Новый Массив();
		Список.Добавить(СписокДокументов);
	КонецЕсли;
	
	ИсключаемыеДокументы = Новый Массив();
	
	ИндикаторКворумаПрисутствияПереопределяемый.ДополнитьИсключаемыеДокументыПриПроверкеКворумаПрисутствия(ИсключаемыеДокументы, Список);
	
	Список = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Список, ИсключаемыеДокументы);
	
	Результат = Новый Соответствие();
	
	Если Список.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТипДокумента = ТипЗнч(Список[0]);
	
	Данные = ПрочитатьДанные(Список);
	
	СведенияДокументов	= Данные.СведенияДокументов;
	СведенияКомиссий	= Данные.СведенияКомиссий;
	
	ПоискДокументСсылка = Новый Структура("ДокументСсылка");
	
	ПоискКомиссияСсылка = Новый Структура("КомиссияСсылка");
	
	Для Каждого ДокументСсылка Из Список Цикл
		ПоискДокументСсылка.ДокументСсылка = ДокументСсылка;
		
		МассивСтрок = СведенияДокументов.НайтиСтроки(ПоискДокументСсылка);
		
		СведенияДокумента = МассивСтрок[0];
		
		КомиссияСсылка = СведенияДокумента.КомиссияСсылка;
		
		РезультатПроверки = ПолучитьПустойРезультатПроверкиДостиженияКворумаПрисутствия();
		
		РезультатПроверки.КомиссияЗаполнена = ЗначениеЗаполнено(КомиссияСсылка);
		
		Если ЗначениеЗаполнено(КомиссияСсылка) Тогда
			ПоискКомиссияСсылка.КомиссияСсылка = КомиссияСсылка;
			
			МассивСтрок = СведенияКомиссий.НайтиСтроки(ПоискКомиссияСсылка);
			
			СведенияКомиссии = МассивСтрок[0];
			
			ИндикаторКворумаПрисутствияПереопределяемый.ЗаполнитьРезультатПроверкиДостиженияКворумаПрисутствия(РезультатПроверки, ТипДокумента, СведенияДокумента, СведенияКомиссии);
			
			Если РезультатПроверки.КворумДостигнут = Неопределено Тогда
				ЗаполнитьРезультатПроверкиДостиженияКворумаПрисутствияПоУмолчанию(РезультатПроверки, СведенияДокумента, СведенияКомиссии);
			КонецЕсли;
		Иначе
			РезультатПроверки.КворумДостигнут = Ложь;
			РезультатПроверки.ИмяПоляДляВыводаСообщения = "Комиссия";
		КонецЕсли;
		
		Результат.Вставить(ДокументСсылка, РезультатПроверки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Настройка формы документа

Функция ВыполненаИнициализацияМеханизма(Форма)
	
	ИмяРеквизитаНастроек = ИндикаторКворумаПрисутствияКлиентСервер.ПолучитьИмяРеквизитаНастроек();
	
	Возврат ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаНастроек);
	
КонецФункции

Процедура ИнициализироватьФормуДокумента(Форма)
	
	МассивИндикаторов = Новый Массив();
	
	ОписаниеИндикатораПоУмолчанию = ПолучитьОписаниеИндикатораПоУмолчанию();
	
	ИндикаторКворумаПрисутствияПереопределяемый.ЗаполнитьОписанияИндикаторов(МассивИндикаторов,
		ТипЗнч(Форма.Объект.Ссылка),
		ОписаниеИндикатораПоУмолчанию);
	
	Если МассивИндикаторов.Количество() = 0 Тогда
		// Настройки по умолчанию.
		// Применяется один индикатор.
		МассивИндикаторов.Добавить(ОписаниеИндикатораПоУмолчанию);
	КонецЕсли;
	
	ИмяРеквизитаНастроек = ИндикаторКворумаПрисутствияКлиентСервер.ПолучитьИмяРеквизитаНастроек();
	
	// Реквизиты формы
	ДобавитьРеквизитыФормы(Форма, ИмяРеквизитаНастроек);
	
	НастройкиМеханизма = Новый Массив();
	
	// Элементы формы
	ДобавитьЭлементыФормы(Форма, МассивИндикаторов, НастройкиМеханизма);
	
	Форма[ИмяРеквизитаНастроек] = Новый ФиксированныйМассив(НастройкиМеханизма);
	
КонецПроцедуры

Процедура ДобавитьРеквизитыФормы(Форма, ИмяРеквизитаНастроек)
	
	ДобавляемыеРеквизиты = Новый Массив();
	
	// РЕКВИЗИТЫ ФОРМЫ
	
	НовыйРеквизитФормы = Новый РеквизитФормы(ИмяРеквизитаНастроек, Новый ОписаниеТипов());
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

Процедура ДобавитьЭлементыФормы(Форма, МассивИндикаторов, НастройкиМеханизма)
	
	КоличествоИндикаторов = МассивИндикаторов.Количество();
	
	Счетчик = 0;
	
	Для Каждого ОписаниеИндикатора Из МассивИндикаторов Цикл
		Счетчик = Счетчик + 1;
		
		ПрефиксИменЭлементов = СтрШаблон("ИндикаторКворумаПрисутствия%1_", ?(КоличествоИндикаторов = 1, "", Формат(Счетчик, "ЧГ=0")));
		
		НастройкиИндикатора = ПолучитьПустыеНастройкиИндикатора();
		
		НастройкиИндикатора.ОписаниеИндикатора = ОписаниеИндикатора;
		
		ЭлементГруппаИндикатора = Форма.Элементы[ОписаниеИндикатора.ИменаЭлементов.ГруппаИндикатора];
		
		// Группа, передаваемая из формы
		
		НастройкиИндикатора.ИменаЭлементов.Вставить("ГруппаИндикатора", ЭлементГруппаИндикатора.Имя);
		
		ЭлементГруппаИндикатора.Подсказка = "";
		ЭлементГруппаИндикатора.ОтображатьЗаголовок = Ложь;
		ЭлементГруппаИндикатора.РастягиватьПоГоризонтали = Ложь;
		
		Для Каждого Элемент Из ЭлементГруппаИндикатора.ПодчиненныеЭлементы Цикл
			Элемент.Видимость = Ложь;
		КонецЦикла;
		
		
		// Набор страниц
		
		ОбозначениеЭлемента = "ГруппаСтраниц";
		
		ИмяЭлемента = ОбщегоНазначенияБГУ.ПолучитьУникальноеИмяЭлементаФормы(Форма, ПрефиксИменЭлементов + ОбозначениеЭлемента);
		НастройкиИндикатора.ИменаЭлементов.Вставить(ОбозначениеЭлемента, ИмяЭлемента);
		
		ЭлементСтраницыИндикатора = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ЭлементГруппаИндикатора);
		ЭлементСтраницыИндикатора.Вид					= ВидГруппыФормы.Страницы;
		ЭлементСтраницыИндикатора.ОтображениеСтраниц	= ОтображениеСтраницФормы.Нет;
		ЭлементСтраницыИндикатора.ОтображениеПодсказки	= ОтображениеПодсказки.Нет;
		
		
		// Страница "Кворум не достигнут"
		
		ОбозначениеЭлемента = "СтраницаКворумНеДостигнут";
		
		ИмяЭлемента = ОбщегоНазначенияБГУ.ПолучитьУникальноеИмяЭлементаФормы(Форма, ПрефиксИменЭлементов + ОбозначениеЭлемента);
		НастройкиИндикатора.ИменаЭлементов.Вставить(ОбозначениеЭлемента, ИмяЭлемента);
		
		СтраницаКворумНеДостигнут = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ЭлементСтраницыИндикатора);
		СтраницаКворумНеДостигнут.Вид			= ВидГруппыФормы.Страница;
		СтраницаКворумНеДостигнут.Группировка	= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		
		// Картинка "кворум не достигнут"
		
		ОбозначениеЭлемента = "КартинкаКворумНеДостигнут";
		
		ИмяЭлемента = ОбщегоНазначенияБГУ.ПолучитьУникальноеИмяЭлементаФормы(Форма, ПрефиксИменЭлементов + ОбозначениеЭлемента);
		НастройкиИндикатора.ИменаЭлементов.Вставить(ОбозначениеЭлемента, ИмяЭлемента);
		
		НовыйЭлемент = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), СтраницаКворумНеДостигнут);
		НовыйЭлемент.Вид					= ВидДекорацииФормы.Картинка;
		НовыйЭлемент.ОтображениеПодсказки	= ОтображениеПодсказки.Нет;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(БиблиотекаКартинок, "СерыйШар") Тогда
			НовыйЭлемент.Картинка			= БиблиотекаКартинок.СерыйШар;
		КонецЕсли;
		
		
		// Надпись "кворум не достигнут"
		
		ОбозначениеЭлемента = "НадписьКворумНеДостигнут";
		
		ИмяЭлемента = ОбщегоНазначенияБГУ.ПолучитьУникальноеИмяЭлементаФормы(Форма, ПрефиксИменЭлементов + ОбозначениеЭлемента);
		НастройкиИндикатора.ИменаЭлементов.Вставить(ОбозначениеЭлемента, ИмяЭлемента);
		
		НовыйЭлемент = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), СтраницаКворумНеДостигнут);
		НовыйЭлемент.Вид					= ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок				= НСтр("ru='Нет кворума'");
		НовыйЭлемент.ОтображениеПодсказки	= ОтображениеПодсказки.Нет;
		НовыйЭлемент.ЦветТекста				= ЦветаСтиля.ТекстИнформационнойНадписи;
		
		
		// Страница "Кворум достигнут"
		
		ОбозначениеЭлемента = "СтраницаКворумДостигнут";
		
		ИмяЭлемента = ОбщегоНазначенияБГУ.ПолучитьУникальноеИмяЭлементаФормы(Форма, ПрефиксИменЭлементов + ОбозначениеЭлемента);
		НастройкиИндикатора.ИменаЭлементов.Вставить(ОбозначениеЭлемента, ИмяЭлемента);
		
		СтраницаКворумДостигнут = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ЭлементСтраницыИндикатора);
		СтраницаКворумДостигнут.Вид			= ВидГруппыФормы.Страница;
		СтраницаКворумДостигнут.Группировка	= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		
		// Картинка "кворум достигнут"
		
		ОбозначениеЭлемента = "КартинкаКворумДостигнут";
		
		ИмяЭлемента = ОбщегоНазначенияБГУ.ПолучитьУникальноеИмяЭлементаФормы(Форма, ПрефиксИменЭлементов + ОбозначениеЭлемента);
		НастройкиИндикатора.ИменаЭлементов.Вставить(ОбозначениеЭлемента, ИмяЭлемента);
		
		НовыйЭлемент = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), СтраницаКворумДостигнут);
		НовыйЭлемент.Вид					= ВидДекорацииФормы.Картинка;
		НовыйЭлемент.ОтображениеПодсказки	= ОтображениеПодсказки.Нет;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(БиблиотекаКартинок, "ЗеленыйШар") Тогда
			НовыйЭлемент.Картинка			= БиблиотекаКартинок.ЗеленыйШар;
		КонецЕсли;
		
		
		// Надпись "кворум достигнут"
		
		ОбозначениеЭлемента = "НадписьКворумДостигнут";
		
		ИмяЭлемента = ОбщегоНазначенияБГУ.ПолучитьУникальноеИмяЭлементаФормы(Форма, ПрефиксИменЭлементов + ОбозначениеЭлемента);
		НастройкиИндикатора.ИменаЭлементов.Вставить(ОбозначениеЭлемента, ИмяЭлемента);
		
		НовыйЭлемент = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), СтраницаКворумДостигнут);
		НовыйЭлемент.Вид					= ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок				= НСтр("ru='Есть кворум'");
		НовыйЭлемент.ОтображениеПодсказки	= ОтображениеПодсказки.Нет;
		НовыйЭлемент.ЦветТекста				= ЦветаСтиля.ТекстИнформационнойНадписи;
		
		НастройкиМеханизма.Добавить(НастройкиИндикатора);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПодсказкуВеличиныКворума(Форма, НастройкиИндикатора, КомиссияСсылка)
	
	Элементы = Форма.Элементы;
	
	ИменаЭлементов = НастройкиИндикатора.ИменаЭлементов;
	
	Если ЗначениеЗаполнено(КомиссияСсылка) Тогда
		Кворум = НастройкиИндикатора.СвойстваКомиссии.Кворум;
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Кворум присутствия членов комиссии определен величиной %1 %%'"), Формат(Кворум, "ЧДЦ=2,ЧН=""0"""));
	Иначе
		ТекстСообщения = НСтр("ru = 'Комиссия не указана'");
	КонецЕсли;
	
	Элемент = Элементы[ИменаЭлементов.НадписьКворумДостигнут];
	Элемент.Подсказка = ТекстСообщения;
	Элемент.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
	
	Элемент = Элементы[ИменаЭлементов.НадписьКворумНеДостигнут];
	Элемент.Подсказка = ТекстСообщения;
	Элемент.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
	
КонецПроцедуры

Процедура ОбновитьСвойстваКомиссии(Форма, Элемент = Неопределено)
	
	ИмяРеквизитаНастроек = ИндикаторКворумаПрисутствияКлиентСервер.ПолучитьИмяРеквизитаНастроек();
	
	НастройкиМеханизма = Форма[ИмяРеквизитаНастроек];
	
	Если Элемент <> Неопределено Тогда
		НастройкиИндикаторов = ИндикаторКворумаПрисутствияКлиентСервер.ОпределитьНастройкиИндикаторовПоЭлементу(Форма, Элемент);
	Иначе
		НастройкиИндикаторов = НастройкиМеханизма;
	КонецЕсли;
	
	СписокКомиссий = Новый Массив();
	
	// Проверяем настройки только соответствующего индикатора.
	Для Каждого НастройкиИндикатора Из НастройкиИндикаторов Цикл
		КомиссияСсылка = Форма.Объект[НастройкиИндикатора.ОписаниеИндикатора.ИменаЭлементов.КомиссияСсылка];
		
		СписокКомиссий.Добавить(КомиссияСсылка);
	КонецЦикла;
	
	СвойстваКомиссий = ПрочитатьСвойстваКомиссий(СписокКомиссий);
	
	// Проверяем настройки всех индикаторов, в них может быть указана такая же комиссия.
	Для Каждого НастройкиИндикатора Из НастройкиМеханизма Цикл
		КомиссияСсылка = Форма.Объект[НастройкиИндикатора.ОписаниеИндикатора.ИменаЭлементов.КомиссияСсылка];
		
		Если СписокКомиссий.Найти(КомиссияСсылка) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваКомиссии = СвойстваКомиссий.Получить(КомиссияСсылка);
		
		Если НастройкиИндикатора.ОписаниеИндикатора.ЭтоИнвентаризационнаяКомиссия Тогда
			СвойстваКомиссии.Кворум = ИндикаторКворумаПрисутствияКлиентСервер.ПолучитьКворумПрисутствияИнвентаризационнойКомиссииПоУмолчанию();
		КонецЕсли;
		
		НастройкиИндикатора.СвойстваКомиссии = СвойстваКомиссии;
		
		УстановитьПодсказкуВеличиныКворума(Форма, НастройкиИндикатора, КомиссияСсылка);
	КонецЦикла;
	
КонецПроцедуры

Функция ПрочитатьСвойстваКомиссий(СписокКомиссий)
	
	СвойстваКомиссий = Новый Соответствие();
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокКомиссий, "Кворум,СоставКомиссии");
	
	Для Каждого КомиссияСсылка Из СписокКомиссий Цикл
		Если ЗначениеЗаполнено(КомиссияСсылка) Тогда
			Свойства = ЗначенияРеквизитов.Получить(КомиссияСсылка);
			
			Кворум = Свойства.Кворум;
			
			ВремВыборка = Свойства.СоставКомиссии.Выбрать();
			КоличествоСотрудниковВКомиссии = ВремВыборка.Количество();
			
			ЭтоИнвентаризационнаяКомиссия = Ложь;
		Иначе
			Кворум = 0;
			КоличествоСотрудниковВКомиссии = 0;
			ЭтоИнвентаризационнаяКомиссия = Ложь;
		КонецЕсли;
		
		СвойстваКомиссии = ПолучитьПустыеСвойстваКомиссии();
		
		СвойстваКомиссии.Кворум							= Кворум;
		СвойстваКомиссии.КоличествоСотрудниковВКомиссии	= КоличествоСотрудниковВКомиссии;
		СвойстваКомиссии.ЭтоИнвентаризационнаяКомиссия	= ЭтоИнвентаризационнаяКомиссия;
		
		СвойстваКомиссий.Вставить(КомиссияСсылка, СвойстваКомиссии);
	КонецЦикла;
	
	Возврат СвойстваКомиссий;
	
КонецФункции

// Проверки при проведении, при печати

Функция ПрочитатьДанные(СписокДокументов)
	
	ДокументСсылка = СписокДокументов[0];
	
	ВидДокумента = ДокументСсылка.Метаданные().Имя;
	
	ТекстЗапроса = "";
	
	ИндикаторКворумаПрисутствияПереопределяемый.ЗаполнитьТекстЗапросаКоличествоЧленовКомиссииВДокументах(ТекстЗапроса, ТипЗнч(ДокументСсылка));
	
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		ЗаполнитьТекстЗапросаКоличествоЧленовКомиссииВДокументахПоУмолчанию(ТекстЗапроса);
	КонецЕсли;
	
	ТекстШаблон = "
		|////////////////////////////////////////////////////////////////////////////////
		|// [0]. Количество сотрудников в документах
		|//"
		+ ТекстЗапроса
		+ ";
		|////////////////////////////////////////////////////////////////////////////////
		|// [1]. Различные комиссии
		|//
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СправочникКомиссии.Ссылка	КАК Ссылка
		|ПОМЕСТИТЬ
		|	РазличныеКомиссии
		|ИЗ
		|	Документ.%1 КАК Док
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПостоянноДействующиеКомиссии КАК СправочникКомиссии
		|		ПО	Док.Комиссия = СправочникКомиссии.Ссылка
		|ГДЕ
		|	Док.Ссылка В(&СписокДокументов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|// [2]. Свойства комиссий
		|//
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СправочникКомиссии.Ссылка			КАК КомиссияСсылка,
		|	СправочникКомиссии.Кворум			КАК Кворум,
		|	КОЛИЧЕСТВО(ТЧСоставКомиссии.Ссылка)	КАК КоличествоСотрудниковВКомиссии
		|ИЗ
		|	РазличныеКомиссии
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПостоянноДействующиеКомиссии КАК СправочникКомиссии
		|		ПО	РазличныеКомиссии.Ссылка = СправочникКомиссии.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПостоянноДействующиеКомиссии.СоставКомиссии КАК ТЧСоставКомиссии
		|		ПО	СправочникКомиссии.Ссылка = ТЧСоставКомиссии.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	СправочникКомиссии.Ссылка,
		|	СправочникКомиссии.Кворум";
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("СписокДокументов", СписокДокументов);
	ЗапросПоиск.Текст = СтрШаблон(ТекстШаблон, ВидДокумента);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапроса = ЗапросПоиск.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	Данные = Новый Структура();
	
	// [0]. Количество сотрудников в документах
	Данные.Вставить("СведенияДокументов", РезультатыЗапроса[0].Выгрузить());
	
	// [2]. Свойства комиссий
	Данные.Вставить("СведенияКомиссий", РезультатыЗапроса[2].Выгрузить());
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьПредставлениеСпискаДокументовСНедостигнутымКворумом(РезультатыПроверки)
	
	МассивДокументов = Новый Массив();
	
	ПервыйРезультатПроверки = Неопределено;
	
	Для Каждого Элемент Из РезультатыПроверки Цикл
		РезультатПроверки = Элемент.Значение;
		
		Если РезультатПроверки.КворумДостигнут Тогда
			Продолжить;
		КонецЕсли;
		
		МассивДокументов.Добавить(Элемент.Ключ);
		
		Если ПервыйРезультатПроверки = Неопределено Тогда
			ПервыйРезультатПроверки = РезультатПроверки;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Если МассивДокументов.Количество() = 1 Тогда
		Представление = ПолучитьТекстСообщенияДляОдногоДокумента(ПервыйРезультатПроверки.КомиссияЗаполнена);
	Иначе
		МаксДлинаИтоговойСтроки = 300;
		
		ШаблонНомерДата = НСтр("ru = '%1 от %2'");
		
		СинонимДокумента = МассивДокументов[0].Метаданные().Синоним;
		
		ТаблицаНомеровДат = ПолучитьУпорядоченнуюТаблицуНомеровДатДокументов(МассивДокументов);
		
		ВыводимыйМассив = Новый Массив();
		
		Для Каждого СтрокаТаблицы Из ТаблицаНомеровДат Цикл
			ВыводимыйМассив.Добавить(СтрШаблон(ШаблонНомерДата, СтрокаТаблицы.Номер, СтрокаТаблицы.Дата));
		КонецЦикла;
		
		Представление = СтрШаблон(
			НСтр("ru = 'Справочно: Кворум присутствия членов комиссии не достигнут в документах %1: (%2)
				|[СписокДокументов]'"),
			СинонимДокумента,
			МассивДокументов.Количество());
		
		Представление = ОбщегоНазначенияБГУКлиентСервер.ВывестиНомераСтрокВТекстСообщения(Представление, ВыводимыйМассив, МаксДлинаИтоговойСтроки, "[СписокДокументов]");
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПолучитьТекстСообщенияДляОдногоДокумента(КомиссияЗаполнена)
	
	Возврат ?(КомиссияЗаполнена,
		НСтр("ru='Справочно: Кворум присутствия членов комиссии в документе не достигнут'"),
		НСтр("ru='Справочно: Кворум присутствия членов комиссии в документе не достигнут (Комиссия не заполнена)'"));
		
КонецФункции

Функция ПолучитьУпорядоченнуюТаблицуНомеровДатДокументов(МассивДокументов)
	
	ТаблицаНомеровДат = Новый ТаблицаЗначений();
	ТаблицаНомеровДат.Колонки.Добавить("Номер",		Новый ОписаниеТипов("Строка"));
	ТаблицаНомеровДат.Колонки.Добавить("Дата",		Новый ОписаниеТипов("Дата"));
	ТаблицаНомеровДат.Колонки.Добавить("Ссылка",	Новый ОписаниеТипов());
	
	СвойстваДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивДокументов, "Номер,Дата");
	
	Для Каждого ДокументСсылка Из МассивДокументов Цикл
		СвойстваДокумента = СвойстваДокументов.Получить(ДокументСсылка);
		
		НоваяСтрока = ТаблицаНомеровДат.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СвойстваДокумента);
		
		НоваяСтрока.Ссылка = ДокументСсылка;
	КонецЦикла;
	
	ТаблицаНомеровДат.Сортировать("Дата Возр");
	
	Возврат ТаблицаНомеровДат;
	
КонецФункции

// Структуры параметров

Функция ПолучитьПустоеОписаниеИндикатора()
	
	ИменаЭлементов = Новый Структура("
		|ГруппаИндикатора,
		|КомиссияСсылка,
		|ТабличнаяЧастьСоставКомиссии");
		
	ОписаниеИндикатора = Новый Структура("
		|ИменаЭлементов,
		|ЭтоИнвентаризационнаяКомиссия");
	
	ОписаниеИндикатора.ИменаЭлементов = ИменаЭлементов;
	ОписаниеИндикатора.ЭтоИнвентаризационнаяКомиссия = Ложь;
	
	Возврат ОписаниеИндикатора;
	
КонецФункции

Функция ПолучитьПустыеНастройкиИндикатора()
	
	НастройкиИндикатора = Новый Структура();
	НастройкиИндикатора.Вставить("ОписаниеИндикатора",	Новый Структура());
	НастройкиИндикатора.Вставить("ИменаЭлементов",		Новый Структура());
	НастройкиИндикатора.Вставить("СвойстваКомиссии",	Новый Структура());
	
	Возврат НастройкиИндикатора;
	
КонецФункции

Функция ПолучитьПустыеСвойстваКомиссии()
	
	СвойстваКомиссии = Новый Структура("
		|Кворум,
		|КоличествоСотрудниковВКомиссии,
		|ЭтоИнвентаризационнаяКомиссия");
	
	Возврат СвойстваКомиссии;
	
КонецФункции

Функция ПолучитьПустойРезультатПроверкиДостиженияКворумаПрисутствия()
	
	РезультатПроверки = Новый Структура();
	РезультатПроверки.Вставить("КворумДостигнут",			Неопределено); // Не менять, важно для последующего алгоритма
	РезультатПроверки.Вставить("КомиссияЗаполнена",			Неопределено);
	РезультатПроверки.Вставить("ИмяПоляДляВыводаСообщения",	"СоставКомиссии");
	
	Возврат РезультатПроверки;
	
КонецФункции

// Заполнение по умолчанию

Функция ПолучитьОписаниеИндикатораПоУмолчанию()
	
	ОписаниеИндикатора = ПолучитьПустоеОписаниеИндикатора();
	
	ОписаниеИндикатора.ИменаЭлементов.ГруппаИндикатора				= "ГруппаИндикаторКворумаПрисутствия";
	ОписаниеИндикатора.ИменаЭлементов.КомиссияСсылка				= "Комиссия";
	ОписаниеИндикатора.ИменаЭлементов.ТабличнаяЧастьСоставКомиссии	= "СоставКомиссии";
	ОписаниеИндикатора.ЭтоИнвентаризационнаяКомиссия				= Ложь;
	
	Возврат ОписаниеИндикатора;
	
КонецФункции

Процедура ЗаполнитьТекстЗапросаКоличествоЧленовКомиссииВДокументахПоУмолчанию(ТекстЗапроса)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Шапка.Ссылка									КАК ДокументСсылка,
	|	Шапка.Комиссия									КАК КомиссияСсылка,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(ТЧСоставКомиссии.Ссылка), 0)	КАК КоличествоСотрудниковВДокументе,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|		КОГДА НЕ ТЧСоставКомиссии.Отсутствует ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ), 0)										КАК КоличествоСотрудниковПрисутствует
	|ИЗ
	|	Документ.%1 КАК Шапка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.%1.СоставКомиссии КАК ТЧСоставКомиссии
	|		ПО	Шапка.Ссылка = ТЧСоставКомиссии.Ссылка
	|ГДЕ
	|	Шапка.Ссылка В(&СписокДокументов)
	|СГРУППИРОВАТЬ ПО
	|	Шапка.Ссылка,
	|	Шапка.Комиссия";
	
КонецПроцедуры

Процедура ЗаполнитьРезультатПроверкиДостиженияКворумаПрисутствияПоУмолчанию(РезультатПроверки, Знач СведенияДокумента, Знач СведенияКомиссии)
	
	КворумДостигнут = ИндикаторКворумаПрисутствияКлиентСервер.ЕстьКворумПрисутствия(
		СведенияДокумента.КоличествоСотрудниковВДокументе,
		СведенияДокумента.КоличествоСотрудниковПрисутствует,
		СведенияКомиссии.Кворум);
	
	РезультатПроверки.КворумДостигнут = КворумДостигнут;
	РезультатПроверки.ИмяПоляДляВыводаСообщения = "СоставКомиссии";
	
КонецПроцедуры

#КонецОбласти
